app/views/posts/details/_project_details.html.erb


<% post.attachments.each do |attach| %>
---
SELECT `attachments`.* FROM `attachments` WHERE `attachments`.`post_id` = 275