app/views/registrations/_new_company.html.erb

SELECT `companies`.* FROM `companies` WHERE `companies`.`validated` = 1 ORDER BY name
---
	<label>Your company <em>*</em></label>
  	<%= f.collection_select :company_id, Company.where(:validated => true), :id, :name, { :include_blank => 'Please Select' }, { :id => 'user_company' } %>