app/views/shared/_myActivity.html.erb

SELECT COUNT(*) FROM `companies` WHERE `companies`.`id` IN (189, 381, 382, 120, 384, 383, 145, 54, 385, 18, 386, 387, 389, 345, 390, 391, 392, 262, 3, 38, 160, 393, 394, 395, 67, 396, 397, 398, 64, 22, 101, 77, 402, 403, 405, 117, 406, 408, 237, 409, 410, 411, 141, 412, 413, 414, 415, 416, 417, 16, 418, 419, 110, 23, 268, 420, 421, 423, 424, 164, 426, 137, 427, 428, 429, 282, 430, 431, 432, 161, 43, 433, 435, 193, 234, 285, 436, 347, 437, 361, 363, 175, 270, 438, 439, 434, 267, 440, 327, 216, 441, 442, 79, 443, 444, 445, 446, 447, 448, 449, 450, 357, 451, 321, 452, 453, 269, 266, 481, 454, 75, 456, 458, 459, 305, 460, 461, 462, 463, 464, 215, 465, 9, 147, 467, 468, 469, 470, 471, 239, 472, 473, 474, 475, 243, 476, 108, 477, 478, 479, 480, 483, 484, 482, 485, 354, 487, 34, 337, 488, 489, 490, 491, 492, 493, 494, 495, 356, 496, 497, 498, 500, 501, 503, 505, 20, 504, 506, 507, 508, 58, 509, 229, 225, 510, 511, 512, 513, 514, 515, 516, 317, 517)
---
            <% elsif activity.noticeable_type == 'Admin' %>
              <% cp = Company.find(activity.noticeable_id) %>