app/views/posts/_post.html.erb

  		  <div class="illuShowcase">
  		  	<% if post.attachments.size > 0 %>
---
SELECT COUNT(*) FROM `attachments` WHERE `attachments`.`post_id` = 275
SELECT `attachments`.* FROM `attachments` WHERE `attachments`.`post_id` = 275 LIMIT 1