app/controllers/posts_controller.rb

  def index
    session[:who] = 'all' unless session[:who].present?
    session[:who] = params[:who] if params[:who].present?

    @page = params[:page].to_i
    @page = 0 if @page.blank?

    if session[:who].blank? || session[:who] == 'all'
      ids = Post.find_by_sql("SELECT p.* FROM posts p, users u WHERE p.user_id = u.id AND u.role_id = 1 AND p.post_type_id = 2").map(&:id)
      if ids.size > 0
        post = Post.arel_table
        @posts = Post.where(post[:id].not_in(ids)).offset(@page * 10).limit(10).order('created_at desc')
      else
        @posts = Post.offset(@page * 10).limit(10).order('created_at desc')
      end
    else
      ids = []
      if current_user
        profiles = current_user.bookmarks.where(:bookmarkable_type => 'Profile').map(&:bookmarkable_id)
        ids = Profile.find(profiles).map(&:user_id)
---
SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = 4 LIMIT 1

  def show
    @post = Post.send(:with_exclusive_scope) { Post.find(params[:id]) }
    if !@post.validated && @post.user != current_user
      @post = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 275 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 323 LIMIT 1